Console.WriteLine("create by 'cleverplant'");
//DONATE ===> https://yoomoney.ru/to/41001197327567
Console.WriteLine(3 + 5 - 2); // 3 + 5 - 2 => 8 - 2 => 6
Console.WriteLine(2 * 4 * 5 * 10); // 2 * 4 * 5 * 10 => 8 * 5 * 10 => 40 * 10 => 400
//обратите внимание на то, что в C# по умолчанию используется 
//целочисленное деление, 3 / 2 будет 1.
//Задание
//Реализуйте программу, которая вычисляет значение выражения 8 / 2 + 5 - -3 / 2. 
//Не вычисляйте ничего самостоятельно, 
//ваша программа должна производить все вычисления сама.
Console.WriteLine(8 / 2 + 5 - -3 / 2); // 4 + 5 - -1
Console.WriteLine(4 + 5 - -1);
Console.WriteLine(9 - -1);
Console.WriteLine(9 + 1);

