Console.WriteLine(0.2 + 0.1);// => 0.30000000000000004
Console.WriteLine(int.MaxValue);// => 2147483647

//Задание
//Вычислите и выведите на экран произведение двух чисел: 0.39 и 0.22
Console.WriteLine(0.39 * 0.22);
// здесь потом добавлю что такое int, float, double







