//Бинарная операция считается коммутативной, если, поменяв местами операнды, 
//вы получаете тот же самый результат. Очевидно, что сложение — коммутативная операция: 
//3 + 2 = 2 + 3. А вот является ли коммутативной операция вычитания? 
//Нет: 2 - 3 ≠ 3 - 2. 
//Отсюда вывод: всегда обращайте внимание на порядок того, с чем работаете.
//Задание
//Напишите программу, которая считает и последовательно выводит на экран 
//значения следующих математических выражений: «3 умножить на 5» и «-8 разделить на -4».

Console.WriteLine(3 * 5);
Console.WriteLine(-8 / -4);
