// Задание
//Создайте переменную, описывающую количество моих братьев, и присвойте ей значение 2.
//Распечатайте содержимое переменной. 
//Затем сравните свое имя с именем, которое используется в учительском решении

var myBrothersCount = 2;
Console.WriteLine(myBrothersCount);





