Console.WriteLine(8 + 2);
Console.WriteLine(-3); // => -3
//Задание
//Напишите программу, которая посчитает разность 
//между числами 6 и -81 и выведет ответ на экран.
Console.WriteLine(6 - (-81));
Console.WriteLine(81 + 6);


